[
    {
        "id": 1,
        "visible": true,
        "imageUrl": "/assets/img/perfil.png",
        "title": "Quem sou",
        "summary": "Resumo de quem eu sou e o que faço.",
        "body": "<p>Olá, meu nome é Anderson e trabalho desenvolvendo soluções em software, gosto de aprender e aplicar novas tecnologias para solucionar problemas de forma criativa, me formei em Sistemas de informação no ano de 2008 e desde 2006 venho trabalhando na àrea de desenvolvimento de sistemas.</p><p>Desenvolvi meu currículum neste formato para tentar estruturar as informações sobre minha vida profissional de uma maneira um pouco mais dinâmica do que a de um currículum comum, assim posso adicionar mais detalhes que, de outra maneira, iriam gerar muita informação em uma só página.<br><br> Para visualizar um resumo você pode ir até meu <a href=\"www.linkedin.com/in/anderson-davanse\">perfil</a> no linkedIn.</p>",
        "nextArticle": {
            "id": 2,
            "title":"Mais sobre mim",
            "visible": true           
        }
    },
    {
        "id": 2,
        "visible": true,
        "imageUrl": "/assets/img/personalidades.png",
        "title": "Mais sobre mim",
        "summary": "Resumo de quem eu sou e o que faço.",
        "body": "  <p>Para facilitar as coisas adiantei uma tarefa que poderia tomar algum tempo, fiz um teste de personalidade e, apesar de não ser cem por cento preciso, acho uma idéia bem prática, imagine se todas as pessoas de um escritório fizessem um, não seria fantástico?<br>  Poderiam deixar o tipo de personalidade em um local visível, como um post-it no gabinete do computador ou até uma lista da relação pessoa x tipo de personalidade em uma página na intranet da empresa. Assim essas pessoas poderiam ser abordadas segundo sua personalidade, bem no mínimo seria uma experiência interessante. <br> Pois bem, eu fiz o teste <a href=\"https://pt.wikipedia.org/wiki/Tipologia_de_Myers-Briggs\" target=\"_blank\">MBTI</a> de personalidade e segundo o teste minha personalidade é <b><a href=\"https://www.16personalities.com/br/personalidade-istj\" target=\"_blank\">ISTJ-T</a></b> ou \"Logístico\".  <br> Se estiver com curiosidade sobre o teste, você pode fazê-lo por este <a ref=\"https://www.16personalities.com/br/teste-de-personalidade\" target=\"_blank\">link</a>.</p>",
        "nextArticle": {
            "id": 3,
            "title":"Histórico Profissional",
            "visible": true           
        }
    },    
    {
        "id": 3,
        "visible": true,
        "imageUrl": "/assets/img/historico.png",
        "title": "Histórico Profissional",
        "summary": "Descrição das empresas em que já trabalhei",
        "body": "<p> <b>Desenvolvedor de sistemas Sênior</b> <br> Empresa: <i>TMF Group</i> <br> Período: <i>abril de 2015 – presente (4 anos 2 meses)</i><br><br> A TMF é uma multinacional de outsourcing com atuação forte em accounting/TAX e folha de pagamentos no Brasil, adquiriu a divisão de Tecnologia da PWC da qual eu trabalho, portanto continuei com minhas atribuições trabalhando na melhoria contínua das soluções Fiscais utilizando Delphi e .NET com banco de dados SQL-Server e Oracle.</p> <br>                                                                                                                         <p> <b>Desenvolvedor de Sistemas Sênior</b> <br> Empresa: <i>PwC Brasil</i> <br> Período: <i>setembro de 2012 – abril de 2015 (2 anos 8 meses)</i> <br><br>  Empresa multinacional de outsourcing, Trabalhei desde a modelagem até o front-end da solução fiscal que atende todas obrigações federais para clientes de vários setores de indústria e serviços, atuei dando sugestões de melhorias e desenvolvimento de novas funcionalidades.</p><br>                              <p> <b>Desenvolvedor Delphi Pleno</b> <br> Empresa: <i>SBG Software</i> <br> Período: <i>dezembro de 2009 – janeiro de 2011 (1 ano 2 meses)</i> <br><br> Empresa familiar, com 3 desenvolvedores contando comigo, fiz manutenções e melhorias no sistema comercial existente, atuei no módulo de emissão de Nota Fiscal Eletrônica, Arquivos de cobrança bancária (CNAB), Sintegra entre outros, todos desenvolvidos utilizando Delphi com banco de dados MySQL. </p><br>    <p> <b>Desenvolvedor Delphi Jr.</b> <br> Empresa: <i>TIVIT</i> <br> Período: <i>março de 2009 – outubro de 2009 (8 meses)</i>  <br><br> Empresa de callcenter, trabalhei realizando manutenção e melhorias nos sistemas existentes (utilizando Delphi) conforme especificações da equipe de analistas de negócios, muito uso de querys e stored procedures no banco de dados (SQL-Server).</p><br>                                                                   <p> <b>Desenvolvedor Delphi</b> <br> Empresa: <i>BFL</i> <br> Período: <i>julho de 2008 – abril de 2009 (10 meses)</i>  <br><br> Empresa que presta serviços contábeis e fiscais de pequeno porte, trabalhei com desenvolvimento de sistema existente e criação de novos para tratamento e consolidação de informações fiscais e entrega de obrigações utilizando Delphi com banco de dados Oracle e Firebird.</p><br>                                                             <p> <b>Estágio em desenvolvimento de sistemas</b> <br> Empresa: <i>TMKT</i> <br> Período: <i>agosto de 2007 – agosto de 2008 (1 ano e 1 mês)</i> <br><br> Neste callcenter trabalhei no setor de TI como estagiário, tive um aprendizado grande em como trabalhar em equipe, se organizar, ajudar e pedir ajuda, com bastante demanda e pouco tempo, aprendi o que era trabalhar em um ambiente agitado, utilizando bastante banco de dados com grandes volumes de informação, ajudei a dar manutenção em sistemas existentes, importando e extraindo informações em diversos formatos utilizando Delphi e SQL-Server.</p>",
        "nextArticle": {
            "id": 4,
            "title":"Tecnologias",
            "visible": true            
        }
    },
    {
        "id": 4,
        "visible": true,
        "imageUrl": "/assets/img/tecnologias.png",
        "title": "Tecnologias",
        "summary": "Relação das principais tecnologias que já trabalhei",
        "body": "<p> <b><h2>Delphi</h2></b> Trabalhei com delphi desde o meu primeiro estágio, em sua maioria, criando aplicações desktop para diversas finalidades, a primeira vez que começei a programar utilizando delphi foi no departamento de TI de uma empresa de telemarketing, utilizávamos para tratamento e importações de informação para a base de dados em SQL-Server.</p><br><p>   <b><h2>SQL-Server</h2></b>   Desde a época (aproximadamente 10 anos atrás) do meu segundo estágio, utilizo SQL-Server como base de dados realizando diversos tipos de consultas SQL, Views e Stored Procedures, não é o único banco de dados que já trabalhei, mas com certeza é o que mais utilizei até hoje.</p><br><p>   <b><h2>Oracle</h2></b>   Apesar de preferir a flexibilidade do SQL-Server em termos de sintaxe (T-SQL), também já trabalhei com Oracle, também utilizo até hoje pois onde trabalho a solução atende ambos SQL-Server e Oracle, portanto já tive que replicar muita coisa do SQL-Server para o Oracle e vice-versa.</p><br><p>   <b><h2>.NET</h2></b>    Utilizo a plataforma .NET quando a situação exige algo além de aplicações Desktop, como windows services, integrações com outros sistemas e aplicações web, começei a estudar para valer quando percebi que precisava de uma plataforma que atendesse outros tipos de aplicações e estava em alta no mercado, em 2014 consegui tirar uma certificação em C# (uma das linguagens utilizadas pelo .NET) e depois em 2016 passei no exame para aplicações Web (ASP.NET MVC), neste tempo ajudei a construir um portal intranet para controle de tarefas da equipe de desenvolvimento e protótipos de aplicações web, também criei serviços do windows para integrações e consumo de web-services.</p><br><p>   <b><h2>Um pouco mais de .NET</h2></b>   Para desenvolvimento de aplicações web, utilizo Entity Framework, ASP.NET MVC no front-end e WCF para consumo de web-services, posteriormente WebAPI para aplicações SPA utilizando Angular. no caso de desenvolvimento de windows services utilizamos ADO para comunicação com o banco de dados.</p><br><p>   <b><h2>HTML, CSS, JavaScript e JQuery</h2></b>   Quando eu começei a estudar aplicações web em .NET em meados de 2013, tive que aprender estas tecnologias, que são base para qualquer aplicação web.</p><br><p>   <b><h2>Angular 2+</h2></b>   A primeira vez que lidei com Angular, este ainda estava na primeira versão e se chamava AngularJS, fiz alguns protótipos que não foram para produção mas eram bastante funcionais, utilizando bootstrap e jQuery para as funcionalidades como paginação no famigerado dataGrid e dependência de alguns componentes utilizados. <br> Hoje faço projetos pessoais em Angular 2+ para não perder as novidades.</p><br><b><h2>Versionadores</h2></b> Resumindo, para projetos em Delphi utilizo o JEDI, em projetos .NET utilizei por pouco tempo o SVN mas atualmente utilizo o TFS, e Git para projetos pessoais que hospedo no github.com.</p>",        
        "nextArticle": {
            "id": 5,
            "title":"Formação & Certificações",
            "visible": true            
        }        
    },    
    {
        "id": 5,
        "visible": true,
        "imageUrl": "/assets/img/certification.png",
        "title": "Formação & Certificações",
        "summary": "Aqui descrevo minha formação e especializações.",
        "body": "<br> <h2><b>FORMAÇÃO</b></h2><p><b>Universidade de Mogi das Cruzes</b> <br> <i>Bacharel em Análise de Sistemas</i> <br> Período: <i>2005 – 2008</i><br><br> Curso focado em análise de sistemas incluindo planejamento de requisitos, modelagem, documentação e implementação de sistemas de software.</p>   <br><br><br> <hr><br> <h2><b>CURSOS E TREINAMENTOS</b></h2>  <br>  <p><b>Impacta Tecnologia</b><br>Curso: <i>Delphi Standard</i> <br>Período: <i>maio/2007 - duração 40 horas.</i><br><br> Foco em desenvolvimento de aplicações Desktop utilizando Delphi.</p> <br>  <p><b>TDS Tecnologia</b><br> Curso: <i>Delphi 2010</i> <br>Período: <i>maio/2010 - duração 150 horas.</i><br><br> Orientação em objetos e patterns em delphi e aplicações utilizando DataSnap.</p>  <br>   <p><b>Caelum</b><br> Curso: <i>Formação Java</i> <br>Período: <i>abril/2012 - duração 140 horas.</i><br><br> Curso com ênfase em desenvolvimento de aplicações web com a linguagem Java utilizando JSF e Hibernate.</p>   <br>  <p><b>Microsoft</b><br> Curso: <i><a href=\"https://mva.microsoft.com/RewardEvidence.aspx/?key=SMqi3MtIsFnCAdvptw_eXg2\" target=\"_blank\">ASP.NET Core</a></i> <br>Período: <i>junho/2018</i><br><br> Treinamento introdutório na nova plataforma da microsoft para desenvolvimento de sistemas web.</p> <br><br> <hr><br>  <h2><b>CERTIFICAÇÕES</b></h2> <br>  <p> <b>Microsoft</b><br><i><a href=\"https://www.youracclaim.com/badges/f6b8bc9b-7c9d-41fb-9051-45a6b4f08683\" target=\"_blank\">Exam 483: Programming in C#</a></i> <br> Período: <i>Janeiro - 2014</i> <br><br> <i> <a href=\"https://www.youracclaim.com/badges/f6b8bc9b-7c9d-41fb-9051-45a6b4f08683\" target=\"_blank\">Exam 486: Developing ASP.NET MVC Web Applications </a></i> <br> Período: <i>Setembro - 2016</i> <br> </p>",
        "nextArticle": {
            "id": 6,
            "title":"Glossário da Sopa de letrinhas",
            "visible": true            
        }           
    },
    {
        "id": 6,
        "visible": true,
        "imageUrl": "/assets/img/sopa-letras.png",
        "title": "Sopa de letrinhas",
        "summary": "Descrição básica das tecnologias em alta do mercado.",
        "body": "<p>Abaixo descrevo de maneira básica as tecnologias mais utilizadas para desenvolvimento web, estas descrições são para pessoas que não tem conhecimento técnico e serve apenas para se ter uma idéia do que cada uma é utilizada. </p><br><p><h2>HTML</h2> Linguagem de marcação interpretada pelo navegador, ou seja, através de tags como por exemplo <b>&lt;b&gt;</b> que representa conteúdo em <b>negrito</b>, ou ainda a tag <b>&lt;i&gt;</b> que representa um conteúdo em <i>itálico</i>, o navegador interpreta todas as marcações e apresenta a estrutura do website no instante em que você acessa alguma url, por exemplo: <a href=\"https://www.google.com\" target=\"_blank\">www.google.com</a>.</p>  <p>Trecho de código html:<br><br> <code> &lt;html&gt;<br> &nbsp;&nbsp;  &lt;body&gt;<br> &nbsp;&nbsp;&nbsp;&nbsp;   &lt;h2&gt; Hello World &lt;/h2&gt; <br>  &nbsp;&nbsp;  &lt;/body&gt;  <br>  &lt;/html&gt; </code></p><br>  <p><h2>CSS</h2> Linguagem que define a aparência ou estilo das tags HTML, com o CSS é possível definir cores, tamanhos, bordas e até animações.</p>  <p> Trecho código CSS:<br><br>   <code>   div { <br> &nbsp;&nbsp; color:green;<br>&nbsp;&nbsp; font-size: 52px;<br> &nbsp;&nbsp; border: dotted red 1.8px;<br>} </code></p>   <br><p><h2>Javascript</h2> Javascript é a linguagem de programação que é interpretada pelo browser quando um website é acessado, apesar do nome, não tem nenhuma relação com a linguagem de programação Java, Inicialmente utilizado para validar formulários na web, Hoje é peça fundamental para qualquer site dinâmico, é bastante versátil e flexível, Javascript é a linguagem base de bibliotecas como JQuery, Vue e React.</p>  <p> Trecho de código em Javascript:<br><br> <code> //To-Do: testar com parâmetros não numéricos.  <br>function funcaoMultiplicar(parametro_1, parametro_2) { <br> &nbsp;&nbsp; return parametro_1 * parametro_2;   <br> } </code>  </p>  <br><br><p> <h2>  C#  </h2> C# Ou C-Sharp é a linguagem orientada a objetos nativa da plataforma .NET, é utilizada para criar aplicações desktop, web, windows services e muito mais.    <p> Trecho de código C#:<br><br>   <code> class WriteHelloWorld<br>{  <br>  &nbsp;&nbsp;  static void Main(string[] args)<br>   &nbsp;&nbsp;   { <br>  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   System.Console.WriteLine(\"Hello World\");<br>&nbsp;&nbsp;&nbsp;}<br>} </code>             </p>          <br><br><p> <h2>.NET</h2> Framework da microsoft para desenvolvimento de sistemas na plataforma windows foi lançado em meados de 2002, é composto de uma enorme biblioteca que provém as funcionalidades fundamentais para criação de aplicativos desktop, web entre outros.</p>            <br><br><p> <h2>.NET Core</h2> Esta é a reescrita do framework da microsoft, que além de melhorias muito significantes em performance também é multiplataforma, isto é, roda em diferentes sistemas operacionais como linux e MacOS, .NET Core também é open-source, o que significa que qualquer pessoa pode ter acesso ao código fonte e até contribuir com o projeto no <a href=\"https://github.com/dotnet/core\" target=\"_blank\">github</a>. </p>            <br><br><p> <h2> ASP.NET </h2> ASP.NET é o framework da microsoft para a web, no início focava em uma tecnologia chamada WebForms em que a intenção era deixar o desenvolvimento de aplicações web parecidas com o de aplicações desktop, e consequentemente facilitar a transição de programadores de aplicações desktop para a web, Hoje dificilmente projetos são criados utilizando WebForms por existir tecnologias que se provaram mais eficazes para projetos web, o ASP.NET pode ser utilizado nas linguagens C# ou VB.NET.</p>   <br><br><p> <h2> ASP.NET MVC </h2> ASP.NET MVC é uma reinvenção da forma como desenvolver aplicações web da microsoft, foi concebida para corrigir problemas de performance que o WebForms criava conforme as aplicações cresciam, ao mesmo tempo apresentou uma nova forma de desenvolver para web utilizando boas práticas resultando em um código mais limpo, ajudando na hora correção de bugs e desenvolvimento de novas funcionalidades.</p> <br><br>",
        "nextArticle": {
            "id": 7,
            "title":"Primeiro Estágio",
            "visible": false            
        }  
    },
    {
        "id": 7,
        "visible": false,
        "imageUrl": "/assets/img/certification.png",
        "title": "Primeiro Estágio",
        "summary": "Um resumo de como foi o meu primeiro estágio em desenvolvimento de software.",
        "body": "<p>Lembro do meu primeiro estágio, eu estava aproximadamente no 4º trimestre da faculdade e trabalhando em uma metalúrgica, ganhava apenas o suficiente para pagar a faculdade e meu pai me ajudava com o custo do fretado.<br>Eu estava apreensivo em arrumar um estágio na àrea o quanto antes pois já havia concluído que seria bem mais difícil depois de formado,cheguei a esta conclusão depois de observar que em todas as vagas do painel de ofertas de estágio do CIEE que fica dentro da universidade, exigiam algum tipo de experiência prévia.</p><p>Depois de cadastrar meu currículo em portais específicos para estágios, fiz minha primeira entrevista, era uma empresa metalúrgica que fabricava porcas e ficava perto de casa, uns 15 minutos a pé para ser mais exato.<br>A entrevista se resumiu a uma única conversa com a pessoa que seria meu supervisor direto, pelo que sei ele mesmo estava desenvolvendo um sistema que almejava atender todos os departamentos, isso mesmo, um ERP.<br>Não houve nenhum teste técnico, eu só teria que aprender a linguagem que estavam usando e ajudá-lo no que fosse necessário, a propósito a linguagem era escrita num tal de Delphi e o banco de dados era o Firebird.</p>",
        "nextArticle": {
            "id": 7,
            "title":"Quem sou"            
        }  
    }
]